#include <iostream>
using namespace std;

int main()
{
    int a[10][10] = {{0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0},
                     {0,0,0,0,0,0,0,0,0,0}};
    short int n;
    cin>>n;
    
    for(int i=0; i<10; i=i+1)
        for(int j=0; j<10; j=j+1)
            if(i/n%2==j/n%2) a[i][j]=1;      //без IF: заменить эту строчку на a[i][j]=abs(i/n%2-j/n%2);
    
    for(int t=0; t<10; t=t+1)
    {
        for(int d=0; d<10; d=d+1)
            cout<<a[t][d]<<" ";
        cout<<"\n";
    }
    
    return 0;
}
