'''print(bin(-20))'''
#/////////////////////////////////////////////////
'''a='123'
for i in len(a):
	print(i)''' #выведет ошибку (лол, чё, я тут пересматривал свои тесты... фор ин - это только для списков(множеств, словарей)... вот я тупняк)
#/////////////////////////////////////////////////
'''b=[1,2,3]
bb=b
b[1]=7
print(bb)''' #выведет [1,7,3] - передача значения списков производится по ССыЛКЕ!
'''b=[1,2,3]
bb=[i for i in b]
b[1]=7
print(bb)''' #вот так надо, так всё норм
#/////////////////////////////////////////////////
'''s='1+3'
print(int(s))''' # не-а, так нельзя
#/////////////////
'''a = '123'
b = list(a)
print(b)''' # а так вот можно
#/////////////////////////////////////
'''a = str(input()).split(" ")
print(a)''' # выведет массив
#/////////////////////////////////////
'''print((-4)**0.5)'''
#/////////////////////////////////
print(0.0000000000001%1)
print(int(-5.7))
#/////////////////////////////////
